tap "hashicorp/tap"
tap "oven-sh/bun"
brew "python@3.13"
brew "awscli"
brew "fd"
brew "fzf"
brew "git"
brew "go"
brew "htop"
brew "jq"
brew "libpq", link: true
brew "minikube"
brew "mysql-client", link: true
brew "nano"
brew "neovim"
brew "node"
brew "openjdk"
brew "pnpm"
brew "python@3.14"
brew "ripgrep"
brew "sdl2"
brew "tmux"
brew "uv"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
cask "ghostty"
vscode "anysphere.cursorpyright"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "davidanson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode.live-server"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
